--4-01
/* Выведите все данные (*) о сотрудниках с зарплатой, равной максимальной зарплате по всей компании.
Указание: использовать только таблицу employees. */

--4-02
/* Выведите все данные (*) о сотрудниках с зарплатой, равной максимальной зарплате внутри своего отдела.
Указание: Решите задачу с использованием коррелированного подзапроса. */

--4-03
/* Выведите все данные (*) о сотрудниках с зарплатой, равной максимальной зарплате внутри своего отдела.
Указание: Решите задачу с использованием некоррелированного подзапроса во FROM. */

--4-04
/* Выведите все данные (*) о сотрудниках с зарплатой, равной максимальной зарплате внутри своего отдела.
Указание: Решите задачу с использованием некоррелированного подзапроса и оператора IN. */

--4-08
/* Выведите все данные (*) о тех сотрудниках, зарплаты которых больше, чем средняя зарплата в каждом из отделов.
Указание: Использование оператора сравнения с оператором ALL. */

--4-09
/* Выведите все данные (*) о тех сотрудниках, зарплаты которых больше, чем средняя зарплата в хотя бы одном из отделов.
Указание: Использование операторов сравнения с операторами SOME/ANY. */

--4-10
/* Выведите все данные (*) о тех сотрудниках, у которых в трудовой истории (таблица job_history) есть запись о работе в должности ST_CLERK.
Указание: Использование оператора EXISTS. */
